# 1. Беремо за основу легку версію Python (щоб образ не важив гігабайти)
FROM python:3.12-slim

# 2. Вимикаємо буферизацію (щоб логи в терміналі з'являлися миттєво)
ENV PYTHONUNBUFFERED=1

# 3. Створюємо папку для проєкту всередині контейнера
WORKDIR /app

# 4. Спочатку копіюємо ТІЛЬКИ список бібліотек (це для кешування, щоб швидше збиралось)
COPY requirements.txt /app/

# 5. Встановлюємо бібліотеки всередині контейнера
RUN pip install -r requirements.txt

# 6. Тепер копіюємо весь твій код у контейнер
COPY . /app/

# 7. Команда, яка запуститься, коли контейнер стартує (запускаємо сервер)
# 0.0.0.0 означає "слухай всіх", це важливо для Докера
CMD ["python", "manage.py", "runserver", "0.0.0.0:8000"]